## Zoro界面简介

在 Zoro 界面，通过划词来标注内容![image-20190430174539095](/Users/lixin/Desktop/image-20190430174539095.png)



界面左侧：显示的是标注过的文章的基本信息，包括标注时间、编号、ID

界面中间：显示当前的标注文章。

- 上部分：状态栏，表明当前标注任务的类型（主流车系动力标注0410）。可以点击标注指南查看。![image-20190430175159728](/Users/lixin/Documents/Typora/%E5%9B%BE%E7%89%87/image-20190430175159728.png)

- 中上部分：文章分组区，可以对当前文章进行分组。![image-20190430175216779](/Users/lixin/Desktop/image-20190430175216779.png)

- 中下部分：文章标注区，具体标注任务在此进行。**黑色段落是可标注段落。**

  ![image-20190430175501630](/Users/lixin/Desktop/image-20190430175501630.png)

  - 标注方法：鼠标划词后，![image-20190430180830422](/Users/lixin/Desktop/image-20190430180830422.png)系统自动显示"待选标注菜单"，标注员输入词语所属的Slot，选择slot，点击确定。![image-20190430181121488](/Users/lixin/Desktop/image-20190430181121488.png)

  

界面右侧：添加分组后，会显示分组信息。可以修改或删除。标注词语后，会显示标注信息。

- 不标注：文章不含有价值信息，不需要标注时，可点击不标注跳过。
- 提交：所有标注完成后，可点击提交进入下一篇。

![image-20190430181429369](/Users/lixin/Desktop/image-20190430181429369.png)





## 标注目的 

1. 我标注的数据，跟老司机什么关系？ ![image-20190430103926988](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430103926988.png)
2. 标注的数据，![image-20190430104031329](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430104031329.png)目前只标注事实 



## 标注对象 

1. 汽车新闻文章，按照时间划分为概念车、谍照、新车发布、新车上市四种。 
   - 概念车：一款车型 
   - 谍照：一款车型 
   - 新车发布：多款车型（需要分多组）具体信息 
   - 新车上市：多款车型（需要分多组）各种配置 



## 标注流程 

### 1. 分组 

1. 分析该段内容所属的品牌-车系-年代-车型 

   例：

   ![image-20190430104239875](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430104239875.png)

2. 具体分组方法见分组指南

3. 具体车型，是分组的最小粒度（不可再往下分）

### 2. 实体（需要了解实体含义的目的是什么）标注内容是一个个实体？

1. 实体是类的实例，类（class）是自定义类型。例如" class_name brand ”这个类的实体是"品牌"
   - 现阶段实体分为：品牌、厂商、车系、车型![image-20190430113146156](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430113146156.png)
2. 实体的属性包括
   1. 实体属性：data_type 为类
   2. 基本属性：data_type 为基本类型（string、float、int、bool）
3. 这个什么意思？![image-20190430110510278](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430110510278.png)
4. 针对实体，要标注到最小粒度，即基本属性



## 标注原则

- 只标注**事实**，不标注推理结论、不存在、评价性的描述

  - 例：推理结论

    > 12.8英寸的中控大屏增加了车内的科技感

    标注内容：12.8英寸、中控大屏

    标注为：

    - 车型.中控.中控屏.尺寸=12.8英寸 right？
    - 车型.中控.中控屏.名称=中控大屏 right？

    不标注内容：科技感，它是推理结论

  - 只有这3个吗？![image-20190430112258201](/Users/lixin/Documents/Typora/图片/image-20190430112258201.png)

  - 猜测、不确定需不需要标注？

- 文章是否要标注的评价标准？![image-20190430113254010](/Users/lixin/Documents/Typora/图片/image-20190430113254010.png)

  - 不存在事实的段落，不标注
  - 车系无法判断，不标注，因为**没价值**

  

## 分组指南

### 分组指南

分组中不能同时存在的属性有：

### 品牌、厂商界定

- 品牌
  - 出现品牌名（例，宝马）默认分组是品牌
- 厂商
  - 文中提到厂商
  - 合资企业，即品牌有前缀（例，华晨宝马）
  - 老司机品牌中搜索不到



### 车系

- 一般车系：是具体名称（中文或英文）或品牌名+名称（中或英文）

  - 例，雅阁、思域
  - 例，宝马X5

- 特殊车系：车系库中不存在、进口、新能源

  - 车系库不存在：

    - 如果未来即将发布，但车系库中不存在，可自定义
    - 如果是车系后加字母（例Q70L），去掉字母后分组。例，Q70L车系分组为Q70。

  - 进口：车系中有进口选项，且文中明确指出"海外版"、"进口车型"，可选择进口![image-20190430115900508](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430115900508.png)

  - 新能源：

    - 文章中指明新能源，按新能源分组

    - 文章中未明确指明，按能源类型判断

      - 新能源：插电式混合动力、纯电动

        - 例

        > 宝马i7纯电动
        >
        > 宝马3系插电混动版

      - 非新能源：弱混合动力、中混合动力、抢混合动力

        - 例

        > 48V微混动

### 年代款

- 某车型的年代款，以上市时间为准。
- 没有上市时间
  - 文章说明是现款的，指 2018年
  - 没有任何时间描述，以文章发布时间为准![image-20190430132629581](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430132629581.png)



### 车型

- 文中如果存在车型库中的字段（例，高配、低配、高功率、低功率），按车型库分组，多个车型要分多组![image-20190430133825831](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430133825831.png)

- 文中没有车型库中的字段

  - 文中只出现一个车型名称时，按名称分组

    - 例

    > 华晨宝马全新一代3系标准轴距版车型实车首次曝光，
    >
    > 申报图中显示的是一台尾标为325i的标准轴距版车型。

    ​	此段可以将车型自定义分组为：`325i 标准轴距版`

  - 文中出现同一车型多个名称时，参考「车型优先级」分组

  - 文中出现多个车型，且每个车型有对应的属性信息（发动机的排量、功率等）时，每个车型都要分组

    - 例

    ![image-20190430104522645](/Users/lixin/Documents/Typora/图片/标注指南/image-20190430104522645.png)

    - 此段车型分组为：`UX 200`、`UX 260h`、 `UX 260h 四驱版本`

  - 文中未出现多个车型，但有多个属性信息（例，发动机排量、功率）时，根据属性分组

  - 通过发动机的属性（排量、进气形式、功率）和变速箱分组

    - 例

  > 动力方面，新车沿用现有动力系统，搭载1.5L自然吸气发动机，最大功率112马力。传动方面，该车将提供6MT或5AMT两种变速箱。

  ​	此段车型分组为：`1.5L 6MT`、`1.5L 5AMT`

  - 发动机属性和变速箱无法对应到具体车型时，将其放在`默认车型`下面
  - 例

  > 动力方面，全新福克斯ST将搭载2.3T两款汽油发动机和2.0T柴油发动机，其中2.3T汽油发动机最大功率为206kW，而全新福克斯ST所搭载的2.0T柴油发动机最大功率为140kW。传动方面，新车将匹配6速手动变速箱和全新的7速自动变速箱。

    ​	此段车型分组为：`ST 2.3T`、`ST 2.0T`、`默认车型`

    ​	分组`默认车型`，是因为6速/7速变速箱无法对应具体车型。

  - 文中未出现具体车型的名称，或多款未说明的车型，分组为`默认车型`

    - 例

    > 1. 宝马7系今日在日内瓦车展中发布了三款新车型
    > 2. 此外，中配版汽油、中配版混动和高配版混动亚洲龙还配备了可开启的全景电动天窗，其余车型为普通天窗。

    1. 分组为`默认车型`
    2. "中配版汽油、中配版混动和高配版混动"分别分组，"其余车型"分组为`默认车型`

  - 文中出现的车型名称，但没有属性信息，不需要新建分组

    - 例

    > 除了1月16日上市的全新奥迪A6L，奥迪今年还将推出全新Q3、Q5标轴、Q8等车型。

    ​	此段"Q3、Q5标轴、Q8"不用新建分组









## 标注内容



### 规则：

- 标注与新闻开头有关的车型的所有属性
  - 一个车型：所有属性都要标注
  - 两个及两个以上车型：按车型分组，标注对应车型的属性



### 汽车事件信息

汽车事件信息指需要标注的有关汽车的事件信息，包括车展事件、发布事件、上市时间

#### 车展

#### 发布

#### 价格

#### 上市

### 配置



### 动力

！！！如果两个版本（新车和普通版），且提供两款发动机以及高低调校，但没有具体功率、扭矩信息（其他新闻有），如何分组。![image-20190506133422011](/Users/lixin/Documents/Typora/%E5%9B%BE%E7%89%87/image-20190506133422011.png)

！！！ 文中出现车系，车型（UX260h），标注吗？车型两个字需要划吗？文中出现品牌名呢？如果划了，后面可能也会出线具体车型名（四驱版），一个分组中能同时存在两个车型名称吗？

！！！文中前面出现了3.0T发动机，后面也有对应的排量等信息，两个都要标注吗？![image-20190506171217082](/Users/lixin/Documents/Typora/图片/image-20190506171217082.png)

！！！油电混合前面的数值要不要划![image-20190506172017540](/Users/lixin/Documents/Typora/图片/image-20190506172017540.png)

！！！车型问题宝马两款组合介绍的车型怎么划？![image-20190506173204462](/Users/lixin/Documents/Typora/图片/image-20190506173204462.png)

！！！两款发动机，都标了T，传给机器学习有什么意义？它如何分辨哪个是哪个，如果是给机器学习的数据，要标注数据的意义



（标注什么

​	出现于段落不匹配的属性，需要标注吗

​	不标注什么

​	划什么（"车型"划不划）

​	不划什么）





标注标签：

- 排量
- 进气形式
- 气缸排列形式
- 气缸数
- 挡位个数
- 变速箱类型
- 发动机最大功率
- 发动机最大扭矩
- 能源类型
- 系统综合功率



### 部件

## 车型优先级

文中出现多个名称（例，三厢版···高功率···插电混动），按车型优先级判断车型。

- 优先级：![image-20190430134611700](/Users/lixin/Documents/Typora/图片/image-20190430134611700.png)

